// -----------------------------------------------------
// BMP to MSX
// バージョン表示ダイアログ
//										(C)2000/5/6 HRA!
// -----------------------------------------------------

#include <windows.h>
#include <windowsx.h>
#include "Ver.h"
#include "Resource.h"
#include "config.h"

// -----------------------------------------------------
// プロトタイプ

EVENT( onVerClose		);
EVENT( onVerCommand		);
EVENT( onVerInitDlg		);
EVENT( onVerPaint		);

// -----------------------------------------------------
// グローバル変数

// -----------------------------------------------------
//	1.	日本語名
//		ウィンドウ関数
//	2.	引数
//		hWnd	...	(I)	ウィンドウハンドル
//		msg		...	(I)	メッセージ
//		wp		...	(I)	Ｗパラメータ
//		lp		...	(I)	Ｌパラメータ
//	3.	返値
//		TRUE	...	処理済み
//		FALSE	...	未処理
//	4.	備考
//		なし
// -----------------------------------------------------
WINPROC( VerProc )
{
	switch( msg )
	{
		ONEVENT( WM_CLOSE		, onVerClose	);
		ONEVENT( WM_COMMAND		, onVerCommand	);
		ONEVENT( WM_INITDIALOG	, onVerInitDlg	);
		ONEVENT( WM_PAINT		, onVerPaint	);
	}
	return FALSE;
}

// =====================================================
// イベント

// -----------------------------------------------------
//	1.	日本語名
//		ウィンドウ閉じる
//	2.	引数
//		hWnd	...	(I)	ウィンドウハンドル
//		wp		...	(I)	Ｗパラメータ
//		lp		...	(I)	Ｌパラメータ
//	3.	返値
//		TRUE	...	処理済み
//		FALSE	...	未処理
//	4.	備考
//		なし
// -----------------------------------------------------
EVENT( onVerClose )
{
	EndDialog( hWnd,0 );
	return TRUE;
}

// -----------------------------------------------------
//	1.	日本語名
//		コマンド
//	2.	引数
//		hWnd	...	(I)	ウィンドウハンドル
//		wp		...	(I)	Ｗパラメータ
//		lp		...	(I)	Ｌパラメータ
//	3.	返値
//		TRUE	...	処理済み
//		FALSE	...	未処理
//	4.	備考
//		なし
// -----------------------------------------------------
EVENT( onVerCommand )
{
	switch( LOWORD( wp ) )
	{
	ONEVENT( IDOK		, onVerClose		);		// OK
	}
	return TRUE;
}

// -----------------------------------------------------
//	1.	日本語名
//		ダイアログの初期化
//	2.	引数
//		hWnd	...	(I)	ウィンドウハンドル
//		wp		...	(I)	Ｗパラメータ
//		lp		...	(I)	Ｌパラメータ
//	3.	返値
//		TRUE	...	処理済み
//		FALSE	...	未処理
//	4.	備考
//		なし
// -----------------------------------------------------
EVENT( onVerInitDlg )
{
	//	バージョン番号をセットする
	SetDlgItemText( hWnd, IDC_VERSION, CFG_VERSION );

	return TRUE;	// 自動で最初のフォーカスを当ててもらう
}

// -----------------------------------------------------
//	1.	日本語名
//		画面の描画
//	2.	引数
//		hWnd	...	(I)	ウィンドウハンドル
//		wp		...	(I)	Ｗパラメータ
//		lp		...	(I)	Ｌパラメータ
//	3.	返値
//		TRUE	...	処理済み
//		FALSE	...	未処理
//	4.	備考
//		なし
// -----------------------------------------------------
EVENT( onVerPaint )
{
	HDC			hDC;
	PAINTSTRUCT	ps;

	hDC = BeginPaint( hWnd,&ps );
	EndPaint( hWnd,&ps );
	return TRUE;
}
